<a href="https://colab.research.google.com/github/SLCFLAB/Data-Science-Python/blob/main/Day%203/3_3.%20Dataframe%20exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Dataframe manipulation

In [1]:
import pandas as pd

## Q1 
아래 DataFrame을 활용해 남성과 여성 각각 Age가 30이상인 사람들의 평균 Height을 구해보자.

In [2]:
data_frame = pd.DataFrame({
    'Age': [37, 20, 30, 45, 25, 31, 41],
    'Height' : [156, 180, 170, 160, 150, 140, 181],
    'Sex' : ['f','m','m','f','f','f','m']
})
data_frame

   Age  Height Sex
0   37     156   f
1   20     180   m
2   30     170   m
3   45     160   f
4   25     150   f
5   31     140   f
6   41     181   m

## Q2
data source: https://towardsdatascience.com/pandas-in-practice-64be9228062a
* column 별로 결측치가 어느만큼 있을까?
* 출생연도, 교육레벨, 연봉에 대한 정보만 들어있는 데이터프레임 만들어보기
* 연 수입의 범위에 따라 low(75000미만), medium(75000이상~120000미만), high(120000 이상) 값을 매기는 컬럼 만들기
* 교육 레벨에 따른 'annual_income', 'recency', 'store_purchases',  'online_purchases'의 평균 구해보기 (데이터프레임으로)
* 석사 졸업생 중 연봉이 75000이상인 데이터의 수는? 
* 기타) 보고 싶은 데이터 있으면 실습해보기 (결혼상태, 생년월일 등)

In [34]:
url = 'https://raw.githubusercontent.com/SLCFLAB/Data-Science-Python/main/Day%203/data/project_data.csv'
data = pd.read_csv(url)
data.head()

,customer_id,year_of_birth,educational_level,marital_status,annual_income,purhcase_date,recency,online_purchases,store_purchases,complaints,calls,intercoms
0,20201701,1982,Graduation,Single,58138.0,9/4/2012,58,8,4,0,3,11
1,20201702,1950,Graduation,Married,46344.0,3/8/2014,38,1,2,0,3,11
2,20201703,1965,Graduation,Divorced,71613.0,8/21/2013,26,8,10,0,3,11
3,20201704,1984,Graduation,Relationship,26646.0,2/10/2014,26,2,4,0,3,11
4,20201705,1981,PhD,Widowed,58293.0,1/19/2014,94,5,6,0,3,11